app/controllers/articles_controller.rb

	def index
		if params[:user_id].nil?
			@articles = Article.all
---
SELECT `articles`.* FROM `articles`

	def update
		@article = Article.find(params[:id])

		if @article.update(article_params)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `text` = '2222223', `updated_at` = '2017-05-12 00:06:46' WHERE `articles`.`id` = 1

	def create
		@user = User.find(params[:user_id])
		@article = @user.articles.new(article_params)

		if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "11"], ["text", "22"], ["created_at", 2017-04-12 13:33:01 UTC], ["updated_at", 2017-04-12 13:33:01 UTC]]