app/controllers/comments_controller.rb

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1
INSERT INTO `comments` (`commenter`, `body`, `article_id`, `created_at`, `updated_at`) VALUES ('111', '222', 2, '2017-05-14 02:18:26', '2017-05-14 02:18:26')
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1
SELECT  `comments`.* FROM `comments` WHERE `comments`.`article_id` = 2 AND `comments`.`id` = 2 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1
---
 def destroy
  @article = Article.find(params[:article_id])
  @comment = @article.comments.find(params[:id])
  @comment.destroy